<?php
//$a = 0;
//    while($a <= 100)
//    {
//        if ($a % 3 == 0)
//        {
//            echo $a . "<br>";
//        }
//        $a++;
//    }
//    Вот так ставить правильно фигурные скобки?
//      Нечего если буду каждое задание в комментарии оставлять?
// Что бы они между собой не конфликтовали.

###############################################################################

//$i = 0;
//    do
//    {
//          if($i == 0)
//          {
//              echo "$i - ноль. <br>";
//          }
//          elseif($i % 2 == 0)
//          {
//              echo "$i - четное число. <br>";
//          }
//          else
//          {
//              echo "$i - нечетное число.<br>";
//          }
//          $i++;
//
//    } while($i <= 10);
//    echo $i;

###############################################################################


//$arr =
//[
//    "Московская область" => ["Москва", "Зеленоград", "Клин"],
//    "Ленинградская обл"  => [ "Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"]
//];
//$q = "";
//foreach ($arr as $key => $value)
//{
//    echo $key . ": <br>";
//    echo implode(",", $value). ".<br>";
//
//}
//foreach ($arr as $key => $value)
//{
//    echo $key . ":<br>";
//    foreach ($value as $str)
//    {
//        $q .= $str . ",";
//        echo $q;
//        echo rtrim($q,",") . ".";
//    }
//    $q = "";
//}
//        Тут хотел вторым способом, но так и не понял поведение переменной $q
// почему значения начинают заново проходить, то есть получается он прошел один элемент
// затем заново проходит его, что бы пройти дальше, как будто бы поднялся на одну ступеньку,
// спрыгнул
#################################################################################
//
//$alfabet = [
//    'а' => 'a', 'б' => 'b', 'в' => 'v',
//    'г' => 'g', 'д' => 'd', 'е' => 'e',
//    'ё' => 'e', 'ж' => 'zh', 'з' => 'z',
//    'и' => 'i', 'й' => 'y', 'к' => 'k',
//    'л' => 'l', 'м' => 'm', 'н' => 'n',
//    'о' => 'o', 'п' => 'p', 'р' => 'r',
//    'с' => 's', 'т' => 't', 'у' => 'u',
//    'ф' => 'f', 'х' => 'h', 'ц' => 'c',
//    'ч' => 'ch', 'ш' => 'sh', 'щ' => 'sch',
//    'ь' => '\'', 'ы' => 'y', 'ъ' => '\'',
//    'э' => 'e', 'ю' => 'yu', 'я' => 'ya'
//];
//$str = '-жи, -ши, пиши с буквой "И"';
//function translate($str, $alfabet)
//{
//    foreach ( mb_str_split( $str ) as $n )
//    {
//        $i = false;
//        foreach ( $alfabet as $key => $valueangl )
//        {
//            if ( $n == $key )
//            {
//                echo $valueangl;
//                $i = true;
//            }
//            elseif ( $n == mb_strtoupper( $key ) )
//            {
//                echo mb_strtoupper( $valueangl );
//                $i = true;
//            }
//        }
//        if($i == false)
//        {
//            echo $n;
//        }
//    }
//}
//    translate($str,$alfabet);
#################################################################################

//$phrase  = "You should eat fruits, vegetables, and fiber every day.";
//
//function tab ($phrase)
//{
//    echo str_replace(" ", "_", $phrase);
//}
//tab($phrase);

//  Почему то тут return не выводит.

################################################################################

$menu =
    [
        [
            'href' => '#',
            'name' => 'Menu1'
        ],
        [
            'href' => '#',
            'name' => 'Menu2'
        ],
        [
            'href' => '#',
            'name' => 'Menu3'
        ]
    ];
?>
<ul>
    <?php
    foreach ($menu as $key => $value)
        {
            ?>
            <li>
                <a href="<?=$value['href']?>"><?=$value['name']?></a>
            </li>
       <? }?>
</ul>
<!--Уверен что смогу сделать и остальное дз на движке, просто не хватило времени немного-->